lightsource-nz/light_framework_mk3/module/light_ioport/src/portable/stm32/platform.c
static void _spi_write_blocking(struct io_context *io, const uint8_t *data, uint32_t len)
{
        SPI_TypeDef *spi = _spi_of(io->port_id);
        if(!spi || !len)
                return;

#if defined(STM32H743xx)
        //   TSIZE must be reprogrammed per transfer, and the peripheral has to be disabled to
        // change it. Then CSTART begins the transaction. Leaving TSIZE at 0 would put it in
        // continuous mode, where it keeps clocking until stopped -- which on a display shows up
        // as trailing garbage after every write rather than as an error
        spi->CR1 &= ~SPI_CR1_SPE;
        spi->CR2 = len;
        spi->CR1 |= SPI_CR1_SPE;

        //   PRIME THE FIFO BEFORE CSTART, not after. CSTART begins clocking immediately, so
        // setting it first opens a window where the master is driving SCK with nothing to
        // shift out -- the transfer starts underrun. Filling first closes the window entirely
        // for any burst that fits in the FIFO, which every packet on the inter-board link does.
        uint32_t i = 0;
        while(i < len && (spi->SR & SPI_SR_TXP))
                *(volatile uint8_t *)&spi->TXDR = data[i++];

        spi->CR1 |= SPI_CR1_CSTART;

        // anything that did not fit is fed as the shifter drains it
        while(i < len) {
                if(!_spi_wait(&spi->SR, SPI_SR_TXP, true, "TXP"))
                        break;
                *(volatile uint8_t *)&spi->TXDR = data[i++];
        }
        // EOT rather than "TX empty": the last byte has been handed to the shifter, not sent,
        // and dropping CS before it has clocked out truncates the final byte
        _spi_wait(&spi->SR, SPI_SR_EOT, true, "EOT");
        //   the flags are cleared and SPE dropped even when a wait timed out, so a single stuck
        // transfer does not leave the peripheral mid-transaction and poison every one after it
        spi->IFCR = SPI_IFCR_EOTC | SPI_IFCR_TXTFC;
        spi->CR1 &= ~SPI_CR1_SPE;
#else
        for(uint32_t i = 0; i < len; i++) {
                if(!_spi_wait(&spi->SR, SPI_SR_TXE, true, "TXE"))
                        return;
                *(volatile uint8_t *)&spi->DR = data[i];
        }
        // wait for the shift register to drain, then for the peripheral to go idle
        if(!_spi_wait(&spi->SR, SPI_SR_TXE, true, "TXE (drain)"))
                return;
        _spi_wait(&spi->SR, SPI_SR_BSY, false, "BSY to clear");
#endif
}

void _platform_spi4_send_command_byte(struct io_context *io, uint8_t cmd)
{
        _gpio_write(io->io.spi.pin_dc, false);
        _gpio_write(io->io.spi.pin_cs, false);
        _spi_write_blocking(io, &cmd, 1);
        _gpio_write(io->io.spi.pin_cs, true);
}

void _platform_spi4_send_data_byte(struct io_context *io, uint8_t data)
{
        _gpio_write(io->io.spi.pin_dc, true);
        _gpio_write(io->io.spi.pin_cs, false);
        _spi_write_blocking(io, &data, 1);
        _gpio_write(io->io.spi.pin_cs, true);
}

void _platform_spi4_send_data_burst(struct io_context *io, const uint8_t *data, uint32_t len)
{
        // CS asserted once for the whole burst, which is the entire point of this entry point
        _gpio_write(io->io.spi.pin_dc, true);
        _gpio_write(io->io.spi.pin_cs, false);
        _spi_write_blocking(io, data, len);
        _gpio_write(io->io.spi.pin_cs, true);
}

//   no DMA yet, so the "async" send is the blocking one and completion is immediate. That is
// honest rather than lazy: light_display's chunked path polls burst_is_complete() and will
// simply never see an incomplete burst, which costs frame-rate rather than correctness. Worth
// revisiting with the H7's DMA once there is a reason to.
void _platform_spi4_send_data_burst_async(struct io_context *io, const uint8_t *data, uint32_t len)
{
        _platform_spi4_send_data_burst(io, data, len);
}
bool _platform_spi4_burst_is_complete(struct io_context *io)
{
        return true;
}

//   THE 3-PIN MASTER. This was `_unsupported("3-wire spi")` plus four empty send functions, so
// a board-to-board SPI link on this platform brought up nothing and transmitted nothing, while
// every caller looked correct -- the exact mirror of the same hole on the RP2 side. crossfire's
// H7 -> Pico link direction was dead for precisely this reason.
//   the only difference from the SPI4 entry points above is that there is no D/C pin: a 3-pin
// port is SCK, MOSI and CS. As on RP2, a "command" byte is indistinguishable from a data byte
// here, since D/C is what carried that distinction; a 3-wire display encoding D/C as a 9th bit
// is a different protocol and would need its own io_type.
void _platform_spi3_port_init(struct io_context *io)
{
        SPI_TypeDef *spi = _spi_of(io->port_id);
        if(!spi) {
                light_error("no SPI instance for port id %d", io->port_id);
                return;
        }

        _spi_clock_enable(io->port_id);
        _gpio_set_af(io->io.spi.pin_sck, _spi_af(io->port_id));
        _gpio_set_af(io->io.spi.pin_mosi, _spi_af(io->port_id));
        //   CS driven by software, and driven HIGH before anything else uses the port: a slave
        // peer with hardware NSS takes the falling edge as the start of a transaction, so a CS
        // left asserted from init means the first transfer of the port's life is never framed
        _gpio_set_output(io->io.spi.pin_cs);
        _gpio_write(io->io.spi.pin_cs, true);
        if(io->pin_reset != PIN_NONE) {
                _gpio_set_output(io->pin_reset);
                _gpio_write(io->pin_reset, true);
        }

#if defined(STM32H743xx)
        // see _platform_spi4_port_init() -- the H7 generation needs TSIZE per transfer and
        // SPE cleared while CFG1/CFG2 are written
        spi->CR1 = 0;
        spi->CFG1 = (7U << SPI_CFG1_DSIZE_Pos);
        spi->CFG2 = SPI_CFG2_MASTER | SPI_CFG2_SSM | SPI_CFG2_SSOE | SPI_CFG2_AFCNTR;
        spi->CR1 |= SPI_CR1_SSI;
        spi->CR1 |= SPI_CR1_SPE;
#else
        spi->CR1 = SPI_CR1_MSTR | SPI_CR1_SSI | SPI_CR1_SSM;
        spi->CR1 |= SPI_CR1_SPE;
#endif
        io->io.spi.dma_channel = -1;

        light_debug("3-pin spi port id 0x%x opened (sck=0x%x mosi=0x%x cs=0x%x)",
                        io->port_id, io->io.spi.pin_sck, io->io.spi.pin_mosi, io->io.spi.pin_cs);
}
void _platform_spi3_send_command_byte(struct io_context *io, uint8_t cmd)
{
        _gpio_write(io->io.spi.pin_cs, false);
        _spi_write_blocking(io, &cmd, 1);
        _gpio_write(io->io.spi.pin_cs, true);
}
void _platform_spi3_send_data_byte(struct io_context *io, uint8_t data)
{
        _gpio_write(io->io.spi.pin_cs, false);
        _spi_write_blocking(io, &data, 1);
        _gpio_write(io->io.spi.pin_cs, true);
}
//   one CS assertion around the whole burst, which is what delimits a packet for the peer.
//   THIS REQUIRES THE LINK TO RUN IN MODE 1 when the far end is an RP2 slave: with CPHA=0 a
// PL022 slave takes the CS falling edge as the start of a frame, so a burst-long assertion
// gets the first byte through and zeros after it. See light_ioport_set_spi_mode().
void _platform_spi3_send_data_burst(struct io_context *io, const uint8_t *data, uint32_t len)
{
        _gpio_write(io->io.spi.pin_cs, false);
        _spi_write_blocking(io, data, len);
        _gpio_write(io->io.spi.pin_cs, true);
}
// no DMA here either -- see _platform_spi4_send_data_burst_async() for why that is honest
void _platform_spi3_send_data_burst_async(struct io_context *io, const uint8_t *data, uint32_t len)
{
        _platform_spi3_send_data_burst(io, data, len);
}
bool _platform_spi3_burst_is_complete(struct io_context *io)
{
        return true;
}

