lightsource-nz/light_framework_mk3/module/light_ioport/src/portable/stm32/platform.c
//   THE BAUD DIVIDER DIVIDES THE SPI KERNEL CLOCK, WHICH IS NOT THE CORE CLOCK. This used to
// assume SystemCoreClock, with a comment saying that held only "while every prescaler is 1 out
// of reset" and that a board configuring the PLL must revisit it. light_core_chip_stm32h743 now
// configures the PLL, so it needed revisiting: SPI4's kernel clock there is APB2 at 100MHz
// while SystemCoreClock reads 400MHz, so a caller asking for 1MHz quietly got 390kHz. The error
// runs toward slower, which is why nothing failed and nobody noticed.
//   these read the RCC rather than trusting whoever set the tree up, so the answer stays right
// regardless of what configured it, or when.
#if defined(STM32H743xx)
//   the oscillator frequencies are NOT exported by the bare-CMSIS device headers -- the device
// package defines them inside system_stm32h7xx.c, and the copies most code sees come from the
// HAL's conf header, which a HAL-less build like this one does not have. These are the family
// defaults, and so are exactly what SystemCoreClockUpdate() assumes when it computes
// SystemCoreClock; HSE matches the 25MHz crystal that light_core_chip_stm32h743's clock.c is
// written around. A board with a different crystal must override HSE_VALUE.
#ifndef HSI_VALUE
#define HSI_VALUE                       64000000u
#endif
#ifndef CSI_VALUE
#define CSI_VALUE                       4000000u
#endif
#ifndef HSE_VALUE
#define HSE_VALUE                       25000000u
#endif

//   AHB/APB prescaler encodings: the field's top bit enables division at all, the rest select
// the power of two. Indexed by the raw field value.
static const uint8_t _ahb_shift[16] = { 0,0,0,0,0,0,0,0, 1,2,3,4,6,7,8,9 };
static const uint8_t _apb_shift[8]  = { 0,0,0,0, 1,2,3,4 };

static uint32_t _pll_ref_hz(void)
{
        switch(RCC->PLLCKSELR & RCC_PLLCKSELR_PLLSRC) {
        case 0: return (uint32_t)HSI_VALUE >> ((RCC->CR & RCC_CR_HSIDIV) >> RCC_CR_HSIDIV_Pos);
        case 1: return (uint32_t)CSI_VALUE;
        case 2: return (uint32_t)HSE_VALUE;
        default: return 0;                      // no PLL source selected
        }
}
// N is the field plus one, and so are the P/Q/R post-dividers; DIVM is not
static uint32_t _pll_out_hz(uint32_t divm, uint32_t n_field, uint32_t x_field)
{
        uint32_t ref = _pll_ref_hz();
        if(!ref || !divm)
                return 0;
        return (uint32_t)(((uint64_t)(ref / divm) * (n_field + 1u)) / (x_field + 1u));
}
static uint32_t _hclk_hz(void)
{
        uint32_t d1cpre = (RCC->D1CFGR & RCC_D1CFGR_D1CPRE) >> RCC_D1CFGR_D1CPRE_Pos;
        uint32_t hpre   = (RCC->D1CFGR & RCC_D1CFGR_HPRE) >> RCC_D1CFGR_HPRE_Pos;
        // SystemCoreClock is the CPU clock, which is sys_ck already divided by D1CPRE -- so
        // undo that before applying HPRE, or every AHB/APB answer is wrong whenever D1CPRE != 1
        return (SystemCoreClock << _ahb_shift[d1cpre & 0xF]) >> _ahb_shift[hpre & 0xF];
}
static uint32_t _per_ck_hz(void)
{
        switch((RCC->D1CCIPR & RCC_D1CCIPR_CKPERSEL) >> RCC_D1CCIPR_CKPERSEL_Pos) {
        case 0: return (uint32_t)HSI_VALUE >> ((RCC->CR & RCC_CR_HSIDIV) >> RCC_CR_HSIDIV_Pos);
        case 1: return (uint32_t)CSI_VALUE;
        case 2: return (uint32_t)HSE_VALUE;
        default: return 0;                      // per_ck disabled
        }
}
#endif

static uint32_t _spi_kernel_hz(uint8_t port_id)
{
#if defined(STM32H743xx)
        uint32_t divm1 = (RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM1) >> RCC_PLLCKSELR_DIVM1_Pos;
        uint32_t divm2 = (RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM2) >> RCC_PLLCKSELR_DIVM2_Pos;
        uint32_t divm3 = (RCC->PLLCKSELR & RCC_PLLCKSELR_DIVM3) >> RCC_PLLCKSELR_DIVM3_Pos;
        uint32_t n1 = (RCC->PLL1DIVR & RCC_PLL1DIVR_N1) >> RCC_PLL1DIVR_N1_Pos;
        uint32_t n2 = (RCC->PLL2DIVR & RCC_PLL2DIVR_N2) >> RCC_PLL2DIVR_N2_Pos;
        uint32_t n3 = (RCC->PLL3DIVR & RCC_PLL3DIVR_N3) >> RCC_PLL3DIVR_N3_Pos;

        switch(port_id) {
        case 1: case 2: case 3:
                switch((RCC->D2CCIP1R & RCC_D2CCIP1R_SPI123SEL) >> RCC_D2CCIP1R_SPI123SEL_Pos) {
                case 0: return _pll_out_hz(divm1, n1,
                                (RCC->PLL1DIVR & RCC_PLL1DIVR_Q1) >> RCC_PLL1DIVR_Q1_Pos);
                case 1: return _pll_out_hz(divm2, n2,
                                (RCC->PLL2DIVR & RCC_PLL2DIVR_P2) >> RCC_PLL2DIVR_P2_Pos);
                case 2: return _pll_out_hz(divm3, n3,
                                (RCC->PLL3DIVR & RCC_PLL3DIVR_P3) >> RCC_PLL3DIVR_P3_Pos);
                case 4: return _per_ck_hz();
                default: return 0;              // I2S_CKIN: an external pin, unknowable here
                }
        case 4: case 5:
                switch((RCC->D2CCIP1R & RCC_D2CCIP1R_SPI45SEL) >> RCC_D2CCIP1R_SPI45SEL_Pos) {
                case 0: return _hclk_hz() >> _apb_shift[
                                ((RCC->D2CFGR & RCC_D2CFGR_D2PPRE2) >> RCC_D2CFGR_D2PPRE2_Pos) & 7];
                case 1: return _pll_out_hz(divm2, n2,
                                (RCC->PLL2DIVR & RCC_PLL2DIVR_Q2) >> RCC_PLL2DIVR_Q2_Pos);
                case 2: return _pll_out_hz(divm3, n3,
                                (RCC->PLL3DIVR & RCC_PLL3DIVR_Q3) >> RCC_PLL3DIVR_Q3_Pos);
                case 3: return (uint32_t)HSI_VALUE >> ((RCC->CR & RCC_CR_HSIDIV) >> RCC_CR_HSIDIV_Pos);
                case 4: return (uint32_t)CSI_VALUE;
                case 5: return (uint32_t)HSE_VALUE;
                default: return 0;
                }
        case 6:
                switch((RCC->D3CCIPR & RCC_D3CCIPR_SPI6SEL) >> RCC_D3CCIPR_SPI6SEL_Pos) {
                case 0: return _hclk_hz() >> _apb_shift[
                                ((RCC->D3CFGR & RCC_D3CFGR_D3PPRE) >> RCC_D3CFGR_D3PPRE_Pos) & 7];
                case 1: return _pll_out_hz(divm2, n2,
                                (RCC->PLL2DIVR & RCC_PLL2DIVR_Q2) >> RCC_PLL2DIVR_Q2_Pos);
                case 2: return _pll_out_hz(divm3, n3,
                                (RCC->PLL3DIVR & RCC_PLL3DIVR_Q3) >> RCC_PLL3DIVR_Q3_Pos);
                case 3: return (uint32_t)HSI_VALUE >> ((RCC->CR & RCC_CR_HSIDIV) >> RCC_CR_HSIDIV_Pos);
                case 4: return (uint32_t)CSI_VALUE;
                case 5: return (uint32_t)HSE_VALUE;
                default: return 0;
                }
        default: return 0;
        }
#else
        //   F4 and friends: no kernel-clock mux, the SPI runs off its APB bus. SystemCoreClock
        // is HCLK on these parts, so only the APB prescaler is involved.
        static const uint8_t apb_shift[8] = { 0,0,0,0, 1,2,3,4 };
        uint32_t ppre = (port_id == 1)
                        ? ((RCC->CFGR & RCC_CFGR_PPRE2) >> RCC_CFGR_PPRE2_Pos)
                        : ((RCC->CFGR & RCC_CFGR_PPRE1) >> RCC_CFGR_PPRE1_Pos);
        return SystemCoreClock >> apb_shift[ppre & 7];
#endif
}

uint32_t _platform_spi_set_clock(struct io_context *io, uint32_t hz)
{
        SPI_TypeDef *spi = _spi_of(io->port_id);
        if(!spi)
                return 0;

        //   the divider is a power of two from 2 to 256, so the achievable rate is the first
        // one at or below what was asked for -- never above it, since a display that is
        // overclocked fails intermittently rather than cleanly.
        uint32_t src = _spi_kernel_hz(io->port_id);
        if(!src) {
                //   worth saying out loud rather than silently guessing: a kernel clock of zero
                // means the selected source is not running, and the peripheral will configure
                // perfectly and transfer nothing at all
                light_error("spi port id 0x%x has no kernel clock; leaving the divider alone",
                                io->port_id);
                return 0;
        }
        uint32_t div = 0;
        while(div < 7 && (src >> (div + 1)) > hz)
                div++;

#if defined(STM32H743xx)
        spi->CR1 &= ~SPI_CR1_SPE;
        spi->CFG1 = (spi->CFG1 & ~SPI_CFG1_MBR_Msk) | (div << SPI_CFG1_MBR_Pos);
#else
        spi->CR1 &= ~SPI_CR1_SPE;
        spi->CR1 = (spi->CR1 & ~SPI_CR1_BR_Msk) | (div << SPI_CR1_BR_Pos);
        spi->CR1 |= SPI_CR1_SPE;
#endif
        io->io.spi.clock_hz = src >> (div + 1);
        light_debug("spi port id 0x%x re-clocked: requested %d Hz, running at %d Hz",
                        io->port_id, hz, io->io.spi.clock_hz);
        return io->io.spi.clock_hz;
}

void _platform_spi_set_mode(struct io_context *io)
{
        SPI_TypeDef *spi = _spi_of(io->port_id);
        if(!spi)
                return;

        uint32_t cpol = (io->io.spi.mode >> 1) & 1;
        uint32_t cpha = io->io.spi.mode & 1;

        //   SPE must be clear to change these on either generation, and on the H7 the whole of
        // CFG2 is write-protected while the peripheral is enabled. Whether SPE goes back on
        // depends on the role: a master re-enables it per transfer in _spi_write_blocking(),
        // but a slave has nothing that would ever switch it on again, so leaving it off there
        // would quietly disable the receiver.
        bool was_enabled = (spi->CR1 & SPI_CR1_SPE) != 0;
        spi->CR1 &= ~SPI_CR1_SPE;

#if defined(STM32H743xx)
        spi->CFG2 = (spi->CFG2 & ~(SPI_CFG2_CPOL | SPI_CFG2_CPHA))
                        | (cpol ? SPI_CFG2_CPOL : 0U)
                        | (cpha ? SPI_CFG2_CPHA : 0U);
#else
        spi->CR1 = (spi->CR1 & ~(SPI_CR1_CPOL | SPI_CR1_CPHA))
                        | (cpol ? SPI_CR1_CPOL : 0U)
                        | (cpha ? SPI_CR1_CPHA : 0U);
#endif
        if(was_enabled)
                spi->CR1 |= SPI_CR1_SPE;

        light_debug("spi port id 0x%x set to mode %d (cpol=%d cpha=%d)",
                        io->port_id, io->io.spi.mode, cpol, cpha);
}

void _platform_signal_reset(struct io_context *io)
{
        // a panel whose reset is tied to the board's own reset line has no GPIO to pulse, and
        // saying so is better than pulsing an unrelated pin
        if(io->pin_reset == PIN_NONE) {
                light_debug("io context has no reset pin; skipping reset pulse");
                return;
        }
        _gpio_write(io->pin_reset, false);
        light_platform_sleep_ms(10);
        _gpio_write(io->pin_reset, true);
        light_platform_sleep_ms(120);
}

// --- spi slave --------------------------------------------------------------------------------

//   the receiving role, for a board-to-board link rather than a display. Three differences from
// every master above, and each is easy to get wrong by copying one:
//     - NSS/CS is a peripheral INPUT driven by the far end, so it is handed to the alternate
//       function like SCK and MOSI rather than configured as an output. Driving it here would
//       fight the master on the same wire.
//     - hardware slave management (SSM clear) rather than software: the peripheral uses the CS
//       edge to frame incoming words, which is exactly the per-packet framing a link relies on.
//     - no baud rate. A slave is clocked entirely by the master; the clock_hz field is left at
//       whatever the caller set and means nothing here.
void _platform_spi_slave_port_init(struct io_context *io)
{
        SPI_TypeDef *spi = _spi_of(io->port_id);
        if(!spi) {
                light_error("no SPI instance for port id %d", io->port_id);
                return;
        }

        _spi_clock_enable(io->port_id);
        _gpio_set_af(io->io.spi.pin_sck, _spi_af(io->port_id));
        _gpio_set_af(io->io.spi.pin_mosi, _spi_af(io->port_id));
        _gpio_set_af(io->io.spi.pin_cs, _spi_af(io->port_id));

#if defined(STM32H743xx)
        //   disable before reconfiguring: CFG1/CFG2 are write-protected while SPE is set, and
        // the writes are silently dropped rather than refused
        spi->CR1 = 0;
        spi->CFG1 = (7U << SPI_CFG1_DSIZE_Pos);         // 8-bit frames
        //   MASTER clear = slave. SSM clear = hardware NSS, so the master's CS frames the words.
        // TSIZE stays 0, which on this peripheral means "no limit" -- a slave cannot know how
        // many bytes the master intends to send.
        spi->CFG2 = 0;
        spi->CR1 |= SPI_CR1_SPE;
#else
        //   the F4's classic SPI: MSTR clear = slave, SSM clear = hardware NSS. 8-bit is the
        // reset default (DFF clear), so only the bits that differ are written.
        spi->CR1 = 0;
        spi->CR1 |= SPI_CR1_SPE;
#endif
        io->io.spi.dma_channel = -1;

        light_debug("spi slave port id 0x%x opened (sck=0x%x mosi=0x%x cs=0x%x)",
                        io->port_id, io->io.spi.pin_sck, io->io.spi.pin_mosi, io->io.spi.pin_cs);
}

