lightsource-nz/light_framework_mk3/module/light_ioport/src/portable/stm32/platform.c
//   NOT IMPLEMENTED HERE YET, so the context keeps reading the FIFO directly and the caller is
// told plainly. The H7's 16-byte FIFO gives twice the slack an RP2 PL022 does, which is why the
// RP2 side was done first, but the exposure is the same in kind: at 6.25MHz a full FIFO is ~26us
// against a 1ms poll interval. Mirroring the RP2 implementation means enabling the SPI2 RXP
// interrupt and draining RXDR into the same ring -- the ring, the overflow reporting and the
// reader in light_ioport are already platform-independent.
bool _platform_spi_slave_start_rx(struct io_context *io)
{
        light_info("buffered slave receive is not implemented on the STM32 platform yet; "
                        "port id 0x%x will keep reading its FIFO directly", io->port_id);
        return false;
}

uint32_t _platform_spi_slave_read_available(struct io_context *io, uint8_t *out, uint32_t max)
{
        SPI_TypeDef *spi = _spi_of(io->port_id);
        if(!spi)
                return 0;

        //   drains only what has already arrived and returns; never waits for a byte. A slave
        // cannot make its master send, so blocking here would stall a run loop on a peer that
        // may be saying nothing at all.
        uint32_t n = 0;
        while(n < max) {
#if defined(STM32H743xx)
                if(!(spi->SR & SPI_SR_RXP))
                        break;
                //   an 8-BIT read of RXDR. A 32-bit access pops a whole packet regardless of
                // DSIZE, so reading the wrong width silently discards three bytes in four.
                out[n++] = *(volatile uint8_t *) &spi->RXDR;
#else
                if(!(spi->SR & SPI_SR_RXNE))
                        break;
                out[n++] = (uint8_t) spi->DR;
#endif
        }
        return n;
}

// --- unimplemented transports ----------------------------------------------------------------
//   present so that light_ioport links whichever transport a board's code refers to, and loud
// at runtime rather than silently doing nothing, which is how a display that never lights up
// becomes an afternoon of staring at wiring

static void _unsupported(const uint8_t *what)
{
        light_error("%s is not implemented on the STM32 light_ioport platform", what);
}

void _platform_i2c_port_init(struct io_context *io) { _unsupported("i2c"); }
void _platform_pio_spi4_port_init(struct io_context *io) { _unsupported("pio spi (an RP2 peripheral)"); }

void _platform_i2c_send_command_byte(struct io_context *io, uint8_t cmd) { }
void _platform_i2c_send_data_byte(struct io_context *io, uint8_t data) { }
void _platform_i2c_send_data_burst(struct io_context *io, const uint8_t *data, uint32_t len) { }
bool _platform_i2c_read_register(struct io_context *io, uint8_t reg, uint8_t *out, uint32_t len) { return false; }
bool _platform_i2c_write_register(struct io_context *io, uint8_t reg, const uint8_t *data, uint32_t len) { return false; }
void _platform_i2c_send_data_burst_async(struct io_context *io, const uint8_t *data, uint32_t len) { }
bool _platform_i2c_burst_is_complete(struct io_context *io) { return true; }

void _platform_pio_spi4_send_command_byte(struct io_context *io, uint8_t cmd) { }
void _platform_pio_spi4_send_data_byte(struct io_context *io, uint8_t data) { }
void _platform_pio_spi4_send_data_burst(struct io_context *io, const uint8_t *data, uint32_t len) { }
void _platform_pio_spi4_send_data_burst_async(struct io_context *io, const uint8_t *data, uint32_t len) { }
bool _platform_pio_spi4_burst_is_complete(struct io_context *io) { return true; }
